In [1]:
import pandas as pd

In [2]:
forum_users = {
    "User ID": [1,2,3,4,5],
    "Username": ['bogdan', 'vova', 'Lena', 'dima', 'andrey'],
    "Age": [18 ,35, 25, 38, None],
    "Joined Date": pd.to_datetime(['2032-01-01', '2022-08-01', '2035-11-21', '2027-12-01', '2002-05-10']),
    "Total Posts": [150, 320, 80, 420, 310],
    "Reputation": [500, 720, 200, 940, 500]
}
df = pd.DataFrame(forum_users)
df

   User ID Username   Age Joined Date  Total Posts  Reputation
0        1   bogdan  18.0  2032-01-01          150         500
1        2     vova  35.0  2022-08-01          320         720
2        3     Lena  25.0  2035-11-21           80         200
3        4     dima  38.0  2027-12-01          420         940
4        5   andrey   NaN  2002-05-10          310         500

## Filtering

In [3]:
df[['Username', 'Age']]

  Username   Age
0   bogdan  18.0
1     vova  35.0
2     Lena  25.0
3     dima  38.0
4   andrey   NaN

In [4]:
df.loc[3]

User ID                          4
Username                      dima
Age                           38.0
Joined Date    2027-12-01 00:00:00
Total Posts                    420
Reputation                     940
Name: 3, dtype: object

In [5]:
df.loc[2:3]

   User ID Username   Age Joined Date  Total Posts  Reputation
2        3     Lena  25.0  2035-11-21           80         200
3        4     dima  38.0  2027-12-01          420         940

In [6]:
df.loc[2:3, ["Username", "Reputation", "Joined Date"]]

  Username  Reputation Joined Date
2     Lena         200  2035-11-21
3     dima         940  2027-12-01

In [7]:
df.iloc[3]

User ID                          4
Username                      dima
Age                           38.0
Joined Date    2027-12-01 00:00:00
Total Posts                    420
Reputation                     940
Name: 3, dtype: object

In [8]:
df.iloc[2:4]

   User ID Username   Age Joined Date  Total Posts  Reputation
2        3     Lena  25.0  2035-11-21           80         200
3        4     dima  38.0  2027-12-01          420         940

In [9]:
df.iloc[2:4, 1:4]

  Username   Age Joined Date
2     Lena  25.0  2035-11-21
3     dima  38.0  2027-12-01

In [10]:
df[df["Age"] >= 25]

   User ID Username   Age Joined Date  Total Posts  Reputation
1        2     vova  35.0  2022-08-01          320         720
2        3     Lena  25.0  2035-11-21           80         200
3        4     dima  38.0  2027-12-01          420         940

In [11]:
df["Age"] >= 25

0    False
1     True
2     True
3     True
4    False
Name: Age, dtype: bool

In [12]:
df[(df["Total Posts"] >= 400) | (df["Age"] <= 25)]

   User ID Username   Age Joined Date  Total Posts  Reputation
0        1   bogdan  18.0  2032-01-01          150         500
2        3     Lena  25.0  2035-11-21           80         200
3        4     dima  38.0  2027-12-01          420         940

In [14]:
df["Reputation"].isin([200, 500])

0     True
1    False
2     True
3    False
4     True
Name: Reputation, dtype: bool

In [16]:
df[df["Reputation"].isin([200, 500])]

   User ID Username   Age Joined Date  Total Posts  Reputation
0        1   bogdan  18.0  2032-01-01          150         500
2        3     Lena  25.0  2035-11-21           80         200
4        5   andrey   NaN  2002-05-10          310         500

In [18]:
df[df["Total Posts"].isin(range(200, 350))]

   User ID Username   Age Joined Date  Total Posts  Reputation
1        2     vova  35.0  2022-08-01          320         720
4        5   andrey   NaN  2002-05-10          310         500

In [26]:
date_range = pd.date_range(start='2002-01-01', end='2034-08-01')

df[df["Joined Date"].isin(date_range)]

   User ID Username   Age Joined Date  Total Posts  Reputation
0        1   bogdan  18.0  2032-01-01          150         500
1        2     vova  35.0  2022-08-01          320         720
3        4     dima  38.0  2027-12-01          420         940
4        5   andrey   NaN  2002-05-10          310         500

## Sorting

In [32]:
df[['User ID', "Age", "Total Posts", 'Reputation']].sort_values(by=2, axis=1, ascending=False)

   Reputation  Total Posts   Age  User ID
0         500          150  18.0        1
1         720          320  35.0        2
2         200           80  25.0        3
3         940          420  38.0        4
4         500          310   NaN        5

In [28]:
df.sort_values(by='Joined Date', ascending=False)

   User ID Username   Age Joined Date  Total Posts  Reputation
2        3     Lena  25.0  2035-11-21           80         200
0        1   bogdan  18.0  2032-01-01          150         500
3        4     dima  38.0  2027-12-01          420         940
1        2     vova  35.0  2022-08-01          320         720
4        5   andrey   NaN  2002-05-10          310         500

In [27]:
df.sort_values(by='Age')

   User ID Username   Age Joined Date  Total Posts  Reputation
0        1   bogdan  18.0  2032-01-01          150         500
2        3     Lena  25.0  2035-11-21           80         200
1        2     vova  35.0  2022-08-01          320         720
3        4     dima  38.0  2027-12-01          420         940
4        5   andrey   NaN  2002-05-10          310         500